import React, {Fragment} from "react";
import SectionTitle from "../components/section-title";
import FilmThumb from "../components/film-thumb";

const films = [
    {
        id: 1,
        genre: "драма",
        name: "Брати. Остання сповідь ",
        year: "2020",
        duration: "123 хв",
        director: "Вікторія Трохименко",
        roles: "Ґольшіфтег Фарагані, Мадж Мастура, Айша Бен Мілед",
        about: "Історія любові та ненависті двох братів, які доживають віку в карпатському селі. Історія любові та ненависті двох братів, які доживають віку в карпатському селі.",
        image: "images/filmThumb.png",
        country: "Франція",
        achievements: "",
        archive: false
    },
    {
        id: 2,
        genre: "трилер",
        name: "Олдбой ",
        year: "2013",
        duration: "110 хв",
        director: "Спайк Лі",
        roles: "Джош Бролін, Шарлто Коплі, Елізабет Олсен, Семюел Л. Джексон, Майкл Імперіолі, Пом Клементьефф, Джеймс Рэнсон, Макс Казелла, Лінда Эмонд, Елвіс Ноласко",
        about: "Фільм розповідає про рекламника, якого хтось викрав і 20 років протримав в одиночній камері, ніяк не пояснюючи своїх мотивів. Настільки ж несподівано отримавши одного разу свободу, він вирішує розшукати того, хто організував його викрадення, і виявляє, що невідомий злодій продовжує мучити його загадками.",
        image: "images/filmThumb.png",
        country: "Франція",
        achievements: "",
        archive: false

    },
    {
        id: 3,
        genre: "детектив",
        name: "Анабель",
        year: "2014",
        duration: "110 хв",
        director: "Джон Р. Леонетті",
        roles: "Аннабелль Уолліс, Уорд Хортон, Элфри Вудард, Тоні Амендола, Ерік Ладен, Керрі О'меллі, Брайан Хау, Івар Броггер, Джофф Уэнер, Гебріел Бейтман",
        about: "Джон Форм знайшов чудовий подарунок для своєї вагітної дружини Міа - прекрасну, дуже рідкісну вінтажну ляльку в білій шлюбній сукні. Але радість Міа від подарунка була недовгою.",
        image: "images/filmThumb.png",
        country: "Франція",
        achievements: "",
        archive: false

    },
    {
        id: 4,
        genre: "драма",
        name: "Брати. Остання сповідь 2",
        year: "2020",
        duration: "123 хв",
        director: "Вікторія Трохименко",
        roles: "Ґольшіфтег Фарагані, Мадж Мастура, Айша Бен Мілед",
        about: "Історія любові та ненависті двох братів, які доживають віку в карпатському селі.",
        image: "images/filmThumb.png",
        country: "Франція",
        achievements: "",
        archive: false

    },
    {
        id: 5,
        genre: "трилер",
        name: "Олдбой 2",
        year: "2013",
        duration: "110 хв",
        director: "Спайк Лі",
        roles: "Джош Бролін, Шарлто Коплі, Елізабет Олсен, Семюел Л. Джексон, Майкл Імперіолі, Пом Клементьефф, Джеймс Рэнсон, Макс Казелла, Лінда Эмонд, Елвіс Ноласко",
        about: "Фільм розповідає про рекламника, якого хтось викрав і 20 років протримав в одиночній камері, ніяк не пояснюючи своїх мотивів. Настільки ж несподівано отримавши одного разу свободу, він вирішує розшукати того, хто організував його викрадення, і виявляє, що невідомий злодій продовжує мучити його загадками.",
        image: "images/filmThumb.png",
        country: "Франція",
        achievements: "",
        archive: false

    },
    {
        id: 6,
        genre: "детектив",
        name: "Анабель 2",
        year: "2014",
        duration: "110 хв",
        director: "Джон Р. Леонетті",
        roles: "Аннабелль Уолліс, Уорд Хортон, Элфри Вудард, Тоні Амендола, Ерік Ладен, Керрі О'меллі, Брайан Хау, Івар Броггер, Джофф Уэнер, Гебріел Бейтман",
        about: "Джон Форм знайшов чудовий подарунок для своєї вагітної дружини Міа - прекрасну, дуже рідкісну вінтажну ляльку в білій шлюбній сукні. Але радість Міа від подарунка була недовгою.",
        image: "images/filmThumb.png",
        country: "Франція",
        achievements: "",
        archive: false

    },
    {
        id: 7,
        genre: "драма",
        name: "Брати. Остання сповідь 3",
        year: "2020",
        duration: "123 хв",
        director: "Вікторія Трохименко",
        roles: "Ґольшіфтег Фарагані, Мадж Мастура, Айша Бен Мілед",
        about: "Історія любові та ненависті двох братів, які доживають віку в карпатському селі. Історія любові та ненависті двох братів, які доживають віку в карпатському селі.",
        image: "images/filmThumb.png",
        country: "Франція",
        achievements: "",
        archive: false

    },
    {
        id: 8,
        genre: "трилер",
        name: "Олдбой 3",
        year: "2013",
        duration: "110 хв",
        director: "Спайк Лі",
        roles: "Джош Бролін, Шарлто Коплі, Елізабет Олсен, Семюел Л. Джексон, Майкл Імперіолі, Пом Клементьефф, Джеймс Рэнсон, Макс Казелла, Лінда Эмонд, Елвіс Ноласко",
        about: "Фільм розповідає про рекламника, якого хтось викрав і 20 років протримав в одиночній камері, ніяк не пояснюючи своїх мотивів. Настільки ж несподівано отримавши одного разу свободу, він вирішує розшукати того, хто організував його викрадення, і виявляє, що невідомий злодій продовжує мучити його загадками.",
        image: "images/filmThumb.png",
        country: "Франція",
        achievements: "",
        archive: false

    },
    {
        id: 9,
        genre: "детектив",
        name: "Анабель 3",
        year: "2014",
        duration: "110 хв",
        director: "Джон Р. Леонетті",
        roles: "Аннабелль Уолліс, Уорд Хортон, Элфри Вудард, Тоні Амендола, Ерік Ладен, Керрі О'меллі, Брайан Хау, Івар Броггер, Джофф Уэнер, Гебріел Бейтман",
        about: "Джон Форм знайшов чудовий подарунок для своєї вагітної дружини Міа - прекрасну, дуже рідкісну вінтажну ляльку в білій шлюбній сукні. Але радість Міа від подарунка була недовгою.",
        image: "images/filmThumb.png",
        country: "Франція",
        achievements: "",
        archive: false
    },
    {
        id: 10,
        genre: "драма",
        name: "Брати. Остання сповідь 4 Брати. Остання сповідь 4 Брати. Остання сповідь 4",
        year: "2020",
        duration: "123 хв",
        director: "Вікторія Трохименко",
        roles: "Ґольшіфтег Фарагані, Мадж Мастура, Айша Бен Мілед",
        about: "Історія любові та ненависті двох братів, які доживають віку в карпатському селі. Історія любові та ненависті двох братів, які доживають віку в карпатському селі.",
        image: "images/filmThumb.png",
        country: "Франція",
        achievements: "",
        archive: false

    },
    {
        id: 11,
        genre: "трилер",
        name: "Олдбой 4",
        year: "2013",
        duration: "110 хв",
        director: "Спайк Лі",
        roles: "Джош Бролін, Шарлто Коплі, Елізабет Олсен, Семюел Л. Джексон, Майкл Імперіолі, Пом Клементьефф, Джеймс Рэнсон, Макс Казелла, Лінда Эмонд, Елвіс Ноласко",
        about: "Фільм розповідає про рекламника, якого хтось викрав і 20 років протримав в одиночній камері, ніяк не пояснюючи своїх мотивів. Настільки ж несподівано отримавши одного разу свободу, він вирішує розшукати того, хто організував його викрадення, і виявляє, що невідомий злодій продовжує мучити його загадками.",
        image: "images/filmThumb.png",
        country: "Франція",
        achievements: "",
        archive: false

    },
    {
        id: 12,
        genre: "детектив",
        name: "Анабель 4",
        year: "2019",
        duration: "110 хв",
        director: "Джон Р. Леонетті",
        roles: "Аннабелль Уолліс, Уорд Хортон, Элфри Вудард, Тоні Амендола, Ерік Ладен, Керрі О'меллі, Брайан Хау, Івар Броггер, Джофф Уэнер, Гебріел Бейтман",
        about: "Джон Форм знайшов чудовий подарунок для своєї вагітної дружини Міа - прекрасну, дуже рідкісну вінтажну ляльку в білій шлюбній сукні. Але радість Міа від подарунка була недовгою.",
        image: "images/filmThumb.png",
        country: "Франція",
        achievements: "",
        archive: true
    },
    {
        id: 13,
        genre: "драма",
        name: "Анабель",
        year: "2018",
        duration: "110 хв",
        director: "Джон Р. Леонетті",
        roles: "Аннабелль Уолліс, Уорд Хортон, Элфри Вудард, Тоні Амендола, Ерік Ладен, Керрі О'меллі, Брайан Хау, Івар Броггер, Джофф Уэнер, Гебріел Бейтман",
        about: "Джон Форм знайшов чудовий подарунок для своєї вагітної дружини Міа - прекрасну, дуже рідкісну вінтажну ляльку в білій шлюбній сукні. Але радість Міа від подарунка була недовгою.",
        image: "images/filmThumb.png",
        country: "Франція",
        achievements: "",
        archive: true
    }
];

const Main = (props) => {
    return (
        <Fragment>
            <section className="section">
                <div className="container">
                    <SectionTitle to="/" title={["Культ", <br key="cultOf"/>, "завтрашнього дня"]}/>
                    <div className="grid-content grid-content__three">
                        {films.map((film) => {
                            return (
                                !film.archive ?
                                    <FilmThumb film={film} key={film.name}/>
                                    : null
                            )
                        })}
                    </div>
                </div>
            </section>
            <section className="section">
                <div className="container">
                    <SectionTitle to="/winners-2019" title="Переможці-2019"/>
                    <div className="grid-content grid-content__two">
                        <FilmThumb film={films[0]}/>
                        <FilmThumb film={films[1]}/>
                    </div>
                </div>
            </section>
            <section className="section">
                <div className="container">
                    <SectionTitle to="/archive" title="Архів"/>
                    <div className="grid-content grid-content__two">
                        {
                            films.sort((a, b) => {
                                return b.year - a.year
                            }).map((film) => {
                                return (
                                    film.archive ?
                                        <FilmThumb film={film} key={film.name}/>
                                        : null
                                )
                            })
                        }
                    </div>
                </div>
            </section>
        </Fragment>
    )
};

export default Main;