import React from 'react';
import './App.scss';
import {Route} from "react-router-dom";
import Navbar from "./components/navbar";
import FilmThumb from "./components/film-thumb";
import SectionTitle from "./components/section-title";

const films = [
    {
        genre: "драма",
        name: "Брати. Остання сповідь ",
        year: "2020",
        duration: "123 хв",
        director: "Вікторія Трохименко",
        roles: "Ґольшіфтег Фарагані, Мадж Мастура, Айша Бен Мілед",
        about: "Історія любові та ненависті двох братів, які доживають віку в карпатському селі. Історія любові та ненависті двох братів, які доживають віку в карпатському селі.",
        image: "images/filmThumb.png",
        archive: false
    },
    {
        genre: "трилер",
        name: "Олдбой ",
        year: "2013",
        duration: "110 хв",
        director: "Спайк Лі",
        roles: "Джош Бролін, Шарлто Коплі, Елізабет Олсен, Семюел Л. Джексон, Майкл Імперіолі, Пом Клементьефф, Джеймс Рэнсон, Макс Казелла, Лінда Эмонд, Елвіс Ноласко",
        about: "Фільм розповідає про рекламника, якого хтось викрав і 20 років протримав в одиночній камері, ніяк не пояснюючи своїх мотивів. Настільки ж несподівано отримавши одного разу свободу, він вирішує розшукати того, хто організував його викрадення, і виявляє, що невідомий злодій продовжує мучити його загадками.",
        image: "images/filmThumb.png",
        archive: false

    },
    {
        genre: "детектив",
        name: "Анабель",
        year: "2014",
        duration: "110 хв",
        director: "Джон Р. Леонетті",
        roles: "Аннабелль Уолліс, Уорд Хортон, Элфри Вудард, Тоні Амендола, Ерік Ладен, Керрі О'меллі, Брайан Хау, Івар Броггер, Джофф Уэнер, Гебріел Бейтман",
        about: "Джон Форм знайшов чудовий подарунок для своєї вагітної дружини Міа - прекрасну, дуже рідкісну вінтажну ляльку в білій шлюбній сукні. Але радість Міа від подарунка була недовгою.",
        image: "images/filmThumb.png",
        archive: false

    },
    {
        genre: "драма",
        name: "Брати. Остання сповідь 2",
        year: "2020",
        duration: "123 хв",
        director: "Вікторія Трохименко",
        roles: "Ґольшіфтег Фарагані, Мадж Мастура, Айша Бен Мілед",
        about: "Історія любові та ненависті двох братів, які доживають віку в карпатському селі.",
        image: "images/filmThumb.png",
        archive: false

    },
    {
        genre: "трилер",
        name: "Олдбой 2",
        year: "2013",
        duration: "110 хв",
        director: "Спайк Лі",
        roles: "Джош Бролін, Шарлто Коплі, Елізабет Олсен, Семюел Л. Джексон, Майкл Імперіолі, Пом Клементьефф, Джеймс Рэнсон, Макс Казелла, Лінда Эмонд, Елвіс Ноласко",
        about: "Фільм розповідає про рекламника, якого хтось викрав і 20 років протримав в одиночній камері, ніяк не пояснюючи своїх мотивів. Настільки ж несподівано отримавши одного разу свободу, він вирішує розшукати того, хто організував його викрадення, і виявляє, що невідомий злодій продовжує мучити його загадками.",
        image: "images/filmThumb.png",
        archive: false

    },
    {
        genre: "детектив",
        name: "Анабель 2",
        year: "2014",
        duration: "110 хв",
        director: "Джон Р. Леонетті",
        roles: "Аннабелль Уолліс, Уорд Хортон, Элфри Вудард, Тоні Амендола, Ерік Ладен, Керрі О'меллі, Брайан Хау, Івар Броггер, Джофф Уэнер, Гебріел Бейтман",
        about: "Джон Форм знайшов чудовий подарунок для своєї вагітної дружини Міа - прекрасну, дуже рідкісну вінтажну ляльку в білій шлюбній сукні. Але радість Міа від подарунка була недовгою.",
        image: "images/filmThumb.png",
        archive: false

    },
    {
        genre: "драма",
        name: "Брати. Остання сповідь 3",
        year: "2020",
        duration: "123 хв",
        director: "Вікторія Трохименко",
        roles: "Ґольшіфтег Фарагані, Мадж Мастура, Айша Бен Мілед",
        about: "Історія любові та ненависті двох братів, які доживають віку в карпатському селі. Історія любові та ненависті двох братів, які доживають віку в карпатському селі.",
        image: "images/filmThumb.png",
        archive: false

    },
    {
        genre: "трилер",
        name: "Олдбой 3",
        year: "2013",
        duration: "110 хв",
        director: "Спайк Лі",
        roles: "Джош Бролін, Шарлто Коплі, Елізабет Олсен, Семюел Л. Джексон, Майкл Імперіолі, Пом Клементьефф, Джеймс Рэнсон, Макс Казелла, Лінда Эмонд, Елвіс Ноласко",
        about: "Фільм розповідає про рекламника, якого хтось викрав і 20 років протримав в одиночній камері, ніяк не пояснюючи своїх мотивів. Настільки ж несподівано отримавши одного разу свободу, він вирішує розшукати того, хто організував його викрадення, і виявляє, що невідомий злодій продовжує мучити його загадками.",
        image: "images/filmThumb.png",
        archive: false

    },
    {
        genre: "детектив",
        name: "Анабель 3",
        year: "2014",
        duration: "110 хв",
        director: "Джон Р. Леонетті",
        roles: "Аннабелль Уолліс, Уорд Хортон, Элфри Вудард, Тоні Амендола, Ерік Ладен, Керрі О'меллі, Брайан Хау, Івар Броггер, Джофф Уэнер, Гебріел Бейтман",
        about: "Джон Форм знайшов чудовий подарунок для своєї вагітної дружини Міа - прекрасну, дуже рідкісну вінтажну ляльку в білій шлюбній сукні. Але радість Міа від подарунка була недовгою.",
        image: "images/filmThumb.png",
        archive: false
    },
    {
        genre: "драма",
        name: "Брати. Остання сповідь 4 Брати. Остання сповідь 4 Брати. Остання сповідь 4",
        year: "2020",
        duration: "123 хв",
        director: "Вікторія Трохименко",
        roles: "Ґольшіфтег Фарагані, Мадж Мастура, Айша Бен Мілед",
        about: "Історія любові та ненависті двох братів, які доживають віку в карпатському селі. Історія любові та ненависті двох братів, які доживають віку в карпатському селі.",
        image: "images/filmThumb.png",
        archive: false

    },
    {
        genre: "трилер",
        name: "Олдбой 4",
        year: "2013",
        duration: "110 хв",
        director: "Спайк Лі",
        roles: "Джош Бролін, Шарлто Коплі, Елізабет Олсен, Семюел Л. Джексон, Майкл Імперіолі, Пом Клементьефф, Джеймс Рэнсон, Макс Казелла, Лінда Эмонд, Елвіс Ноласко",
        about: "Фільм розповідає про рекламника, якого хтось викрав і 20 років протримав в одиночній камері, ніяк не пояснюючи своїх мотивів. Настільки ж несподівано отримавши одного разу свободу, він вирішує розшукати того, хто організував його викрадення, і виявляє, що невідомий злодій продовжує мучити його загадками.",
        image: "images/filmThumb.png",
        archive: false

    },
    {
        genre: "детектив",
        name: "Анабель 4",
        year: "2019",
        duration: "110 хв",
        director: "Джон Р. Леонетті",
        roles: "Аннабелль Уолліс, Уорд Хортон, Элфри Вудард, Тоні Амендола, Ерік Ладен, Керрі О'меллі, Брайан Хау, Івар Броггер, Джофф Уэнер, Гебріел Бейтман",
        about: "Джон Форм знайшов чудовий подарунок для своєї вагітної дружини Міа - прекрасну, дуже рідкісну вінтажну ляльку в білій шлюбній сукні. Але радість Міа від подарунка була недовгою.",
        image: "images/filmThumb.png",
        archive: true
    },
    {
        genre: "драма",
        name: "Анабель",
        year: "2022",
        duration: "110 хв",
        director: "Джон Р. Леонетті",
        roles: "Аннабелль Уолліс, Уорд Хортон, Элфри Вудард, Тоні Амендола, Ерік Ладен, Керрі О'меллі, Брайан Хау, Івар Броггер, Джофф Уэнер, Гебріел Бейтман",
        about: "Джон Форм знайшов чудовий подарунок для своєї вагітної дружини Міа - прекрасну, дуже рідкісну вінтажну ляльку в білій шлюбній сукні. Але радість Міа від подарунка була недовгою.",
        image: "images/filmThumb.png",
        archive: true
    }
];

function App() {
    return (
        <div className="App">
            <Navbar/>
            <Route
                path="/"
                exact
            >
                <section className="section">
                    <div className="container">
                        <SectionTitle to="/" title={["Культ", <br key="cultOf"/>, "завтрашнього дня"]}/>
                        <div className="grid-content grid-content__three">
                            {films.map((film) => {
                                return (
                                    !film.archive ?
                                        <FilmThumb film={film} key={film.name}/>
                                        : null
                                )
                            })}
                        </div>
                    </div>
                </section>
                <section className="section">
                    <div className="container">
                        <SectionTitle to="/winners-2019" title="Переможці-2019"/>
                        <div className="grid-content grid-content__two">
                            <FilmThumb film={films[0]}/>
                            <FilmThumb film={films[1]}/>
                        </div>
                    </div>
                </section>
                <section className="section">
                    <div className="container">
                        <SectionTitle to="/archive" title="Архів"/>
                        <div className="grid-content grid-content__two">
                            {
                                films.sort((a, b) => {
                                    return b.year - a.year
                                }).map((film) => {
                                    return (
                                        film.archive ?
                                            <FilmThumb film={film} key={film.name}/>
                                            : null
                                    )
                                })
                            }
                        </div>
                    </div>
                </section>
            </Route>
            <Route
                path="/winners-2019"
                exact
            >
                Winners 2019
            </Route>
            <Route
                path="/archive"
                exact
            >
                Archive
            </Route>
        </div>
    );
}

export default App;
